app/controllers/notes_controller.rb

INSERT INTO "notes" ("updated_at", "title", "body", "created_at") VALUES('2009-07-07 04:29:06', 'Demoing Cucumber', 'A long description', '2009-07-07 04:29:06')
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save